controllers/CartController.php

    public function actionIndex()
    {
        $userId = Yii::$app->user->id;
        $cart = Cart::find()->where(['user_id' => $userId])->orderBy(['created_at' => SORT_DESC])->one();
---
SELECT * FROM `cart` WHERE `user_id`=2 ORDER BY `created_at` DESC

    public function actionAdd($id = null)
    {
        Yii::$app->response->format = \yii\web\Response::FORMAT_JSON;

        $request = Yii::$app->request;

        if ($request->isPost && $id === null) {
            $id = $request->bodyParams['id'] ?? null;
        }

        if (!$id || !($product = Product::findOne($id))) {
            return ['success' => false, 'message' => 'Товар не найден'];
        }

        $userId = Yii::$app->user->id;

        $cart = Cart::find()
            ->where(['user_id' => $userId])
            ->orderBy(['created_at' => SORT_DESC])
            ->one();

        if (!$cart) {
            $cart = new Cart();
            $cart->user_id = $userId;
            $cart->save(false);
        }

        $item = CartItem::findOne(['cart_id' => $cart->id, 'product_id' => $id]);
---
SELECT * FROM `product` WHERE `id`='24'
SELECT * FROM `cart` WHERE `user_id`=2 ORDER BY `created_at` DESC
SELECT * FROM `cart_item` WHERE (`cart_id`=12) AND (`product_id`='24')

            ]);
        }

        $item->save(false);
---
INSERT INTO `cart_item` (`cart_id`, `product_id`, `quantity`) VALUES (12, 24, 1)
UPDATE `cart_item` SET `quantity`=2 WHERE `id`=248

    public function actionDecrease($id)
    {
        Yii::$app->response->format = \yii\web\Response::FORMAT_JSON;

        $userId = Yii::$app->user->id;

        $cart = Cart::find()
            ->where(['user_id' => $userId])
            ->orderBy(['created_at' => SORT_DESC])
            ->one();

        if (!$cart) {
            return ['success' => false, 'message' => 'Корзина не найдена'];
        }

        $item = CartItem::findOne(['cart_id' => $cart->id, 'product_id' => $id]);

        if (!$item) {
            return ['success' => false, 'message' => 'Товар не найден в корзине'];
        }

        $item->quantity -= 1;

        if ($item->quantity <= 0) {
            $item->delete();
            return ['success' => true, 'quantity' => 0];
        }

        $item->save(false);
---
SELECT * FROM `cart` WHERE `user_id`=2 ORDER BY `created_at` DESC
SELECT * FROM `cart_item` WHERE (`cart_id`=12) AND (`product_id`='24')
DELETE FROM `cart_item` WHERE `id`=248
UPDATE `cart_item` SET `quantity`=1 WHERE `id`=248