controllers/ProductController.php

SELECT COUNT(*) FROM `product_image` WHERE `product_id`=17
---
    public function actionUpdate($id)
    {
        $model = $this->findModel($id);

        if ($this->request->isPost) {
            $model->load($this->request->post());
            $model->mainImageFile = UploadedFile::getInstance($model, 'mainImageFile');
            $model->extraImageFiles = UploadedFile::getInstances($model, 'extraImageFiles');

            // Подсчёт существующих и новых фото
            $existing = ProductImage::find()->where(['product_id' => $model->id])->count();

SELECT * FROM `product` WHERE `id`='17'
---
    protected function findModel($id)
    {
        if (($model = Product::findOne(['id' => $id])) !== null) {

SELECT * FROM `category`
---
    public function actionCatalog()
    {
        $searchModel = new ProductSearch();
        $dataProvider = $searchModel->search(Yii::$app->request->queryParams);
        $dataProvider->pagination->pageSize = 12;

        $categories = Category::find()->all();