controllers/SiteController.php

    public function actionResetPassword($token)
    {
        $user = User::findOne(['password_reset_token' => $token]);

        if (!$user || !$this->isTokenValid($token)) {
            throw new BadRequestHttpException('Неверный или устаревший токен.');
        }

        $model = new \app\models\ResetPasswordForm();
        if ($model->load(Yii::$app->request->post()) && $model->validate()) {
            $user->password = Yii::$app->security->generatePasswordHash($model->password);
            $user->password_reset_token = null;
            $user->save(false);
---
SELECT * FROM `user` WHERE `password_reset_token`='8pzPt5PBy4ORunv_JTBtUBmjJ1Av4rwW_1749931291'
UPDATE `user` SET `password`='$2y$13$ejCWX7ndZ65XMXa8ug6LROzz5PXHERtU/oG18ke5KiYJ3875sdW9K', `password_reset_token`=NULL WHERE `id`=2