views/product/_form.php


    <?php $form = ActiveForm::begin(['options' => ['enctype' => 'multipart/form-data']]); ?>

    <?= $form->field($model, 'category_id')->dropDownList(
        ArrayHelper::map(Category::find()->orderBy('name')->all(), 'id', 'name'),
        ['prompt' => 'Выберите категорию']
    )->label('Категория') ?>
---
SELECT * FROM `category` ORDER BY `name`