models/PasswordResetRequestForm.php

SELECT * FROM `user` WHERE `email`='paleanelo@vk.com'
UPDATE `user` SET `password_reset_token`='8pzPt5PBy4ORunv_JTBtUBmjJ1Av4rwW_1749931291' WHERE `id`=2
---
    public function sendEmail()
    {
        $user = User::findOne(['email' => $this->email]);
        if (!$user) {
            return false;
        }

        // Генерация токена (можно хранить в отдельном поле, например password_reset_token)
        $user->password_reset_token = Yii::$app->security->generateRandomString() . '_' . time();
        $user->save(false);