models/ProductImage.php

SELECT EXISTS(SELECT * FROM `product` WHERE `product`.`id`=23)
SELECT * FROM `product` WHERE `id`=23
---
    public function uploadAndSave()
    {
        if ($this->validate()) {
            if ($this->imageFile) {
                $product = Product::findOne($this->product_id);

INSERT INTO `product_image` (`product_id`, `is_main`, `image_path`) VALUES (23, 1, 'img/Gretskie orehi Chili v skorlupe/gretskie orehi.jpg')
---
                        $this->is_main = 0;
                    }

                    return $this->save(false); // сохраняем модель product_image

SELECT COUNT(*) FROM `product_image` WHERE `product_id`=23
---
    public function validatePhotoLimit($attribute, $params)
    {
        if (!$this->product_id) {
            return;
        }

        $existingCount = ProductImage::find()
            ->where(['product_id' => $this->product_id])
            ->count();