models/Product.php

    public static function deactivateExpired()
    {
        $now = time();

        $products = self::find()
            ->where(['is_active' => 1])
            ->andWhere(['>', 'expire_days', 0])
            ->all();
---
SELECT * FROM `product` WHERE (`is_active`=1) AND (`expire_days` > 0)